Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: As you can see, we can define several fields for the same property. Here, we define a `@KeywordField` with a specific name. The main difference is that a keyword field is not tokenized (the string is kept as one single token) but can be normalized (i.e. filtered) - more on this later. This field is marked as sortable as our intention is to use it for sorting our authors.
ja_jp: このように、同じプロパティに複数のフィールドを定義することができます。ここでは、固有の名前を持つ `@KeywordField` を定義しています。主な違いは、キーワードフィールドはトークン化されません（文字列は1つのトークンとして保持される）が、正規化（すなわちフィルタリング）することができるということです。これについては後で説明します。このフィールドは `Author` のソートに使用することを意図しているため、ソート可能であるとマークされています。

source: As you can see, we don't have to manually validate the provided `Book` anymore as it is automatically validated.
ja_jp: ご覧のように、提供された `Book` は自動的に検証されるので、もう手動で検証する必要はありません。

source: As you can see, you can use the full power of Asciidoctor (except for the limitation below)
ja_jp: 見ての通り、Asciidoctorのフルパワーが使えます（以下の制限を除く）

source: As you can see, your entity definition is exactly the same, besides the two interfaces. But now, your entities will not be _managed_, so every update operation has to be explicit:
ja_jp: ご覧のとおり、エンティティー定義は2つのインターフェースを除けばまったく同じです。しかし、これでエンティティーは _管理_ されなくなるため、すべての更新操作を明示的に行う必要があります。

source: As you make changes, you can rebuild the `docs` module specifically to update the generated HTML:
ja_jp: 変更を加えると、特に `docs` モジュールを再構築して、生成された HTML を更新できます。

source: As you may have seen from recent Quarkus Insights episodes (#48, #55 and #57, specifically), we've made a number of changes to our tools in the 2.x stream to improve the developer experience. When 2.0 was released, a few sharp-eyed Quarkus CLI users spotted some new options and we're excited to explain what those are all about with the release of Quarkus 2.1.
ja_jp: 最近のQuarkus Insightsのエピソード（#48、#55、#57）をご覧になった方はご存知かと思いますが、Quarkus 2.xでは開発者のエクスペリエンスを向上させるためにツールに多くの変更を加えました。2.0がリリースされたとき、目の肥えたQuarkus CLIユーザーがいくつかの新しいオプションを見つけました。

source: As you may know, Quarkus is based on Vert.x. Under the hood, there is a managed Vert.x instance that powers the rest of Quarkus.
ja_jp: ご存知のように、QuarkusはVert.xをベースにしています。裏側では、マネージドのVert.xのインスタンスが存在し、Quarkusに力を与えています。

source: As you may know, Quarkus provides container images based on Red Hat Universal Base Image (UBI) both for building applications and for running them.
ja_jp: ご存知の通り、Quarkus はアプリケーションのビルドと実行の両方のために、Red Hat Universal Base Image (UBI) をベースにしたコンテナーイメージを提供しています。

source: As you might expect, these converters are `org.eclipse.microprofile.config.spi.Converter` implementations. Therefore these converters comply with the Microprofile or custom implementation providers expression rules, like:
ja_jp: ご想像のとおり、これらのコンバーターは `org.eclipse.microprofile.config.spi.Converter` の実装です。したがって、これらのコンバーターは、次のような Microprofile またはカスタム実装プロバイダーの式ルールに準拠しています。

source: As you might expect, these converters are `org.eclipse.microprofile.config.spi.Converter` implementations. Therefore, these converters comply with the Microprofile or custom implementation providers expression rules like:
ja_jp: ご想像のとおり、これらのコンバーターは `org.eclipse.microprofile.config.spi.Converter` の実装です。したがって、これらのコンバーターは、次のような Microprofile またはカスタム実装プロバイダーの式ルールに準拠しています。

source: As you probably guessed already, we are not going to implement the interfaces above. Instead, the Object Mapper will generate such implementations for us.
ja_jp: もうお分かりだと思いますが、私たちは上記のインターフェイスを実装しません。代わりに、Object Mapperがそのような実装を生成してくれるのです。

source: As you probably guessed from the name, this work is a *new JAX-RS implementation* written from the ground up to work on our common *Vert.x* layer and is thus fully *reactive*, while also being very *tightly integrated with Quarkus* and consequently moving a lot of framework specific work (like annotation scanning and metamodel generation) to *build time*.
ja_jp: 名前からお察しの通り、この作品は共通の *Vert.x* レイヤー上で動作するように一から書かれた *新しいJAX-RSの実装* であり、完全に *リアクティブ* であると同時に、 *Quarkusと緊密に統合されて* いるため、フレームワーク固有の作業(アノテーションスキャンやメタモデル生成など)の多くを *ビルド時に* 移行させることができます。

source: As you saw above we support the user injecting Marshaller configuration. You can do the inverse with the Infinispan client extension providing injection for `RemoteCacheManager` and `RemoteCache` objects. There is one global `RemoteCacheManager` that takes all of the configuration parameters setup in the above sections.
ja_jp: 上で見たように、Marshaller の設定をユーザが注入することをサポートしています。Infinispan クライアントエクステンションを使用すると、 `RemoteCacheManager` と `RemoteCache` オブジェクトに注入することでその逆のことができます。上記のセクションで設定したすべての設定パラメーターを受け取るグローバル `RemoteCacheManager` があります。

source: As you saw above we support the user injecting Marshaller configuration. You can do the inverse with the Infinispan client extension providing injection for `RemoteCacheManager` and `RemoteCache` objects. There is one global `RemoteCacheManager` that takes all the configuration parameters setup in the above sections.
ja_jp: 上で見たように、私たちはユーザーが Marshaller のコンフィギュレーションをインジェクションすることをサポートしています。Infinispan クライアントエクステンションでは、 `RemoteCacheManager` と `RemoteCache` オブジェクトへのインジェクションを提供し、その逆を行うことができます。 グローバルな `RemoteCacheManager` が一つあり、上記のセクションで設定したすべてのコンフィギュレーションパラメータを受け取ります。

source: As you see in the example above, you can make your `ClientHeadersFactory` implementation a CDI bean by annotating it with a scope-defining annotation, such as `@Singleton`, `@ApplicationScoped`, etc.
ja_jp: 上の例のように、 `@Singleton`, `@ApplicationScoped` などのスコープを定義するアノテーションを付けることで、 `ClientHeadersFactory` の実装をCDI Beanにすることができます。

source: As you will see, it does not pin - no stack trace. It is because the REST client is implemented in a virtual-thread-friendly way.
ja_jp: ご覧のとおり、ピン留めは行われず、スタック トレースも行われません。 これは、REST クライアントが仮想スレッドに適した方法で実装されているためです。

source: AsciiDoc callouts are shown as comments on some lines, and their numbering is not sequential.
ja_jp: AsciiDocのcalloutは、一部の行でコメントとして表示され、その番号は連番ではありません。

source: AsciiDoc content regions are defined by tag pairs (`tag::` and `end::`) in comments surrounding different sections of code.
ja_jp: AsciiDocのコンテンツ領域は、コードの異なるセクションを囲むコメント内のタグペア（ `tag::` と `end::` ）で定義されます。

source: AsciiDoc files are in the `src/main/asciidoc` directory within the `docs` module of the link:{quarkus-base-url}/tree/main/docs[Quarkus GitHub repository].
ja_jp: AsciiDocファイルが、link:{quarkus-base-url}/tree/main/docs[Quarkus GitHub リポジトリー]. の `docs` モジュール内の `src/main/asciidoc` ディレクトリーにある。

source: AsciiDoc files are in the `src/main/asciidoc` directory within the `docs` module of the {quarkus-base-url}/tree/main/docs[Quarkus GitHub repository].
ja_jp: AsciiDocファイルは、 {quarkus-base-url}/tree/main/docs[Quarkus GitHubリポジトリ] の `docs` モジュール内の `src/main/asciidoc` ディレクトリにあります。

source: AsciiDoc output (`html` files) in the `docs/target/generated-docs/` directory.
ja_jp: `docs/target/generated-docs/` ディレクトリにAsciiDoc出力（ `html` ファイル）。

source: AsciiDoc output to HTML
ja_jp: AsciiDocのHTMLへの出力

source: AsciiDoc processing creates HTML files in `docs/target/generated-docs/`.
ja_jp: AsciiDocの処理で、 `docs/target/generated-docs/` にHTMLファイルを作成します。

source: AsciiDoc syntax
ja_jp: Asciidoc 構文

source: Asciidoc output (html files) in the `docs/target/generated-docs/` directory.
ja_jp: `docs/target/generated-docs/`ディレクトリーの Asciidoc 出力 (html ファイル)。

source: Asciidoc output as HTML
ja_jp: Asciidoc 出力の HTML 化

source: Asciidoc syntax
ja_jp: Asciidoc 構文

source: Asciidoc syntax highlighting and the preview provided by an IDE may be enough for minor documentation changes. For significant changes or any changes related to Quarkus configuration documentation, we recommend that you run the build and view the resulting output before submitting your changes for review.
ja_jp: asciidoc の構文強調表示および IDE が提供するプレビューは、ドキュメントの変更が少ない場合は十分な可能性があります。重要な変更、または Quarkus の設定ドキュメントに関連する変更については、レビュー用に変更を送信する前に、ビルドを実行し、結果の出力を確認することが推奨されます。

source: Aside from `mmap`, `malloc` system calls are also present in native executables generated by GraalVM. Let's put bcc/eBPF in action to generate a flamegraph of bytes allocated using `malloc`.
ja_jp: `mmap` 以外に、 `malloc` システムコールも GraalVM が生成するネイティブ実行可能ファイルに存在します。bcc/eBPF を使って、 `malloc` を使って割り当てられたバイトのフレームグラフを生成してみましょう。

source: Aside from debug symbols, setting `-Dquarkus.native.debug.enabled=true` flag generates a cache of source files for any JDK runtime classes, GraalVM classes and application classes resolved during native executable generation. This source cache is useful for native debugging tools, to establish the link between the symbols and matching source code. It provides a convenient way of making just the necessary sources available to the debugger/IDE when debugging a native executable.
ja_jp: デバッグシンボルとは別に、 `-Dquarkus.native.debug.enabled=true` フラグを設定すると、ネイティブ実行可能ファイル生成時に解決された JDK ランタイムクラス、GraalVM クラス、アプリケーションクラスのソースファイルのキャッシュが生成されます。このソースキャッシュは、シンボルと一致するソースコード間のリンクを確立するために、ネイティブデバッグツールにとって有用です。ネイティブ実行可能ファイルをデバッグする際に、必要なソースだけをデバッガー/IDEが利用できるようにする便利な方法を提供します。

source: Aside from debug symbols, setting `-Dquarkus.native.debug.enabled=true` flag generates a cache of source files for any JDK runtime classes, GraalVM classes, and application classes resolved during native executable generation. This source cache is useful for native debugging tools, to establish the link between the symbols and the matching source code. It provides a convenient way of making just the necessary sources available to the debugger/IDE when debugging a native executable.
ja_jp: デバッグシンボル以外に、`-Dquarkus.native.debug.enabled=true` フラグを設定すると、ネイティブ実行ファイルの生成中に解決された JDK ランタイムクラス、GraalVM クラス、およびアプリケーションクラスのソースファイルのキャッシュが生成されます。このソースキャッシュは、シンボルと一致するソースコードの間のリンクを確立するために、ネイティブデバッグツールにとって有用です。これは、ネイティブ実行ファイルをデバッグする際に、必要なソースのみをデバッガーや IDE で利用可能にする便利な方法を提供します。

source: Ask (Quark)us anything No. 4!
ja_jp: 第四回 Quarkus Q&Aセッション!

source: Ask (Quark)us anything!
ja_jp: Quarkusについて何でも聞いてください。

source: Ask on <a href="https://stackoverflow.com/questions/tagged/quarkus">Stack Overflow with the <code>quarkus</code> tag</a>
ja_jp: <a href="https://stackoverflow.com/questions/tagged/quarkus">Stack Overflow (<code>quarkus</code>タグ)で質問</a>

source: Ask this method execution to be cached in the 'weather-cache'
ja_jp: このメソッドの実行を 'weather-cache' にキャッシュするよう指定します。

source: Ask your questions on <a href="https://stackoverflow.com/questions/tagged/quarkus" target="blank">Stack Overflow</a>. After the documentation, it’s probably the best place to look for answers. We actively monitor the <a href="https://stackoverflow.com/questions/tagged/quarkus" target="blank">Quarkus tag</a>.
ja_jp: <a href="https://stackoverflow.com/questions/tagged/quarkus" target="blank">Stack Overflow</a> で質問してください。ドキュメントの次に、おそらく回答を探すのに最適な場所です。私たちは <a href="https://stackoverflow.com/questions/tagged/quarkus" target="blank">Quarkus タグ</a> を積極的に監視しています。

source: Ask your questions on https://stackoverflow.com/questions/tagged/quarkus[Stack Overflow].
ja_jp: https://stackoverflow.com/questions/tagged/quarkus[Stack Overflow] で質問

source: Assert the service call
ja_jp: サービスコールのアサート

source: Assertj out of the BOM
ja_jp: BOMからAssertjを除外

source: Assign a `root` role to the user `alice`.
ja_jp: ユーザー `alice` に `root` ロールを割り当てます。

source: Assign a user and roles to a scheduled task
ja_jp: スケジュールされたタスクへのユーザーとロールの割り当て

source: Assign the user `Alice` to the scheduled `updateTask`.
ja_jp: ユーザー `Alice` をスケジュールされた `updateTask` に割り当てます。

source: Assistant
ja_jp: アシスタント

source: Assistant State
ja_jp: アシスタントの状態

source: Assistant State in the UI
ja_jp: UI におけるアシスタントの状態

source: Assistant log
ja_jp: アシスタントログ

source: Assistant pages
ja_jp: アシスタントページ

source: Assistant themes and UI Components
ja_jp: アシスタントのテーマと UI コンポーネント

source: Assistant-specific pages
ja_jp: アシスタント専用ページ

source: Associate <<define-tags,tags>> with the counter
ja_jp: カウンターに <<define-tags,タグ>> を関連付けます。

source: Associate <<define-tags,tags>> with the distribution summary
ja_jp: ディストリビューションサマリーに <<define-tags,tags>> を関連付けます。

source: Associate <<define-tags,tags>> with the gauge
ja_jp: ゲージに <<define-tags,tags>> を関連付けます。

source: Associate <<define-tags,tags>> with the gauge. Gauge tag values are constant, and must be assigned at construction time.
ja_jp: ゲージに <<define-tags,tags>> を関連付けます。 ゲージタグの値は一定であり、構築時に割り当てる必要があります。

source: Associate <<define-tags,tags>> with the timer
ja_jp: タイマーに <<define-tags,tags>> を関連付けます。

source: Associated with the https://docs.quarkiverse.io/quarkus-web-bundler/dev/[Web Bundler extension], the road is open to build modern web applications for all your needs.
ja_jp: https://docs.quarkiverse.io/quarkus-web-bundler/dev/[Web Bundler エクステンション] と組み合わせることで、あらゆるニーズに対応するモダンな Web アプリケーションを構築する道が開かれます。

source: Associated with the https://docs.quarkiverse.io/quarkus-web-bundler/dev/[Web Bundler extension], the road is open to build modern web applications for all your needs. Here is what a simple Renarde controller looks like:
ja_jp: https://docs.quarkiverse.io/quarkus-web-bundler/dev/[Web Bundler エクステンション] と連携することで、あらゆるニーズに対応する最新の Web アプリケーションを構築できるようになります。シンプルな Renarde コントローラーは次のようになります。

source: Associates `acme-quarkus-magic` with `acme-cloud` offering with support scope `supported`;
ja_jp: `acme-quarkus-magic` を `acme-cloud` 提供物とサポートスコープ `supported` で関連付けます。

source: Associates `acme-quarkus-magic` with `team-x` offering with support scope `tech-preview`.
ja_jp: `acme-quarkus-magic` を `team-x` 提供物とサポートスコープ `tech-preview` で関連付けます。

source: Associating events by request
ja_jp: リクエストによるイベントの関連付け

source: Assume for example that a `PersonRepository` that shouldn't extend `CrudRepository` but would like to use `save` and `findById` methods which are defined in said interface. In such a case, `PersonRepository` would look like so:
ja_jp: たとえば `PersonRepository` は、 `CrudRepository` を拡張するべきではないが、そのインターフェイスで定義されている `save` メソッドと `findById` メソッドを使用したいと想定します。この場合、 `PersonRepository` は次のようになります。

source: Assume for example that fruits repository should be accessible by a `/my-fruits` path and only allow `GET` operation. In such a case, `FruitsRepository` would look like so:
ja_jp: 例えば、フルーツリポジトリは `/my-fruits` のパスでアクセスでき、 `GET` の操作しかできないようにする必要があるとします。このような場合、 `FruitsRepository` は次のようになります:

source: Assume we have a POJO named `Person` which looks like so:
ja_jp: `Person` という名前のPOJOがあり、以下のようになっているとします:

source: Assume your UI will be nested under the dev endpoint. Do not provide a way to customize this without a strong reason.
ja_jp: UIがdevエンドポイントの下に入れ子になっていることを想定してください。強い理由がない限り、これをカスタマイズする方法を提供しないでください。

source: Assuming `/tmp/` is writable this can be fixed by setting the `vertx.cacheDirBase` property to point to a directory in `/tmp/` for instance in Kubernetes by creating an environment variable `JAVA_OPTS` with the value `-Dvertx.cacheDirBase=/tmp/vertx`, or setting the `quarkus.vertx.cache-directory` property in `application.properties`:
ja_jp: `/tmp/` が書き込み可能である場合、これは `vertx.cacheDirBase` プロパティーが `/tmp/` のディレクトリーを指すように設定することで修正できます。たとえば、Kubernetes で `JAVA_OPTS` 環境変数を作成して `-Dvertx.cacheDirBase=/tmp/vertx` という値を設定するか、 `application.properties` で `quarkus.vertx.cache-directory` プロパティーを設定します。

source: Assuming `/tmp/` is writable this can be fixed by setting the `vertx.cacheDirBase` property to point to a directory in `/tmp/` for instance in OpenShift by creating an environment variable `JAVA_OPTS` with the value `-Dvertx.cacheDirBase=/tmp/vertx`.
ja_jp: `/tmp/` が書き込み可能である場合、これは `vertx.cacheDirBase` プロパティが `/tmp/` のディレクトリを指すように設定することで修正できます。例えば、OpenShift では環境変数 `JAVA_OPTS` を作成して `-Dvertx.cacheDirBase=/tmp/vertx` という値を設定します。

source: Assuming an HTTP request containing a file upload and a form value containing a string description need to be handled, we could write a POJO that will hold this information like so:
ja_jp: ファイルのアップロードを含む HTTP リクエストと、文字列の説明を含むフォーム値を処理する必要があると仮定すると、次のようにこの情報を保持する POJO を記述できます。

source: Assuming an HTTP request containing a file upload, a JSON entity and a form value containing a string description, we could write the following endpoint:
ja_jp: ファイルアップロード、JSONエンティティ、文字列の説明を含むフォーム値を含むHTTPリクエストを想定すると、次のようなエンドポイントを書くことができます：

source: Assuming security has been set up for the application (see our xref:security-overview.adoc[guide] for more details), logging attribute `Remote user that was authenticated` is set to the value of the `io.quarkus.security.identity.SecurityIdentity` principal. If your application use custom xref:security-customization.adoc#jaxrs-security-context[Jakarta REST SecurityContext], the context principal is used instead. Please refer to the xref:logging.adoc[Logging guide] for options how to add contextual log information yourself.
ja_jp: アプリケーションのセキュリティが設定されていると仮定すると（詳細は xref:security-overview.adoc[ガイド] を参照）、 ロギング属性 `Remote user that was authenticated` には `io.quarkus.security.identity.SecurityIdentity` プリンシパルの値が設定されます。 アプリケーションがカスタム xref:security-customization.adoc#jaxrs-security-context[Jakarta REST SecurityContext] を使用する場合、代わりにコンテキストプリンシパルが使用されます。 コンテキストログ情報を自分で追加する方法については、 xref:logging.adoc[ロギングガイド] を参照してください。

source: Assuming security has been set up for the application (see our xref:security-overview.adoc[guide] for more details), when a user with the `admin` role performs an HTTP GET on `/person/1` they will receive:
ja_jp: アプリケーションのセキュリティーが設定されていると仮定すると (詳細は xref:security-overview.adoc[ガイド] を参照)、 `admin` ロールを持つユーザーが `/person/1` に対して HTTP GET を実行すると、次のようなメッセージが表示されます。

source: Assuming security has been set up for the application (see our xref:security.adoc[guide] for more details), when a user with the `admin` role performs an HTTP GET on `/person/1` they will receive:
ja_jp: アプリケーションのセキュリティーが設定されていると仮定すると (詳細は xref:security.adoc[ガイド] を参照)、 `admin` ロールを持つユーザーが `/person/1` に対して HTTP GET を実行すると、次のようなメッセージが表示されます。

source: Assuming the link:https://quarkus.io/guides/config-yaml[Quarkus YAML extension] is included, the equivalent YAML configuration is:
ja_jp: link:https://quarkus.io/guides/config-yaml[Quarkus YAML エクステンション] が含まれていると仮定すると、同等の YAML 設定は以下のようになります。

source: Assuming we are using the same JVM to run the application as we used to build the application, we can launch the application like so:
ja_jp: アプリケーションの実行に、アプリケーションのビルドに使用したのと同じJVMを使用すると仮定すると、次のようにアプリケーションを起動することができます。

source: Assuming we have a project including Kogito, Camel and core Quarkus extensions available in the Quarkus platform based on Quarkus `2.7.1.Final`, the output of the `quarkus:update` would look like:
ja_jp: Kogito、Camel、および Quarkus `2.7.1.Final` に基づく Quarkus プラットフォームで利用可能なコア Quarkus エクステンションを含むプロジェクトがあると想定する場合、 `quarkus:update` の出力は以下のようになります。

source: Assuming you rely on Dev Services based on containers (unlike H2 or Derby), if you want to keep Dev Service containers running *after a dev mode session or test suite execution* to reuse them in the next dev mode session or test suite execution, this is possible as well. Just enable https://java.testcontainers.org/features/reuse/[TestContainers reuse] by inserting this line in one of your https://java.testcontainers.org/features/configuration/[TestContainers configuration file] (generally `~/.testcontainers.properties` or `C:/Users/myuser/.testcontainers.properties`):
ja_jp: (H2 や Derby とは異なり) コンテナをベースとした Dev Services を利用しているとして、 Dev Service コンテナを *開発モードセッションやテストスイート実行* 後も実行したままにしておき、 次の開発モードセッションやテストスイート実行時に再利用したい場合、可能です。 link:https://java.testcontainers.org/features/reuse/[TestContainers の再利用] を有効にするには、 link:https://java.testcontainers.org/features/configuration/[TestContainers の設定ファイル] ( `~/.testcontainers.properties` あるいは `C:/Users/myuser/.testcontainers.properties` ) に次の行を記述します：

source: Assuming you rely on Dev Services based on containers (unlike H2), if you want to keep Dev Service containers running *after a dev mode session or test suite execution* to reuse them in the next dev mode session or test suite execution, this is possible as well. Just enable https://java.testcontainers.org/features/reuse/[TestContainers reuse] by inserting this line in one of your https://java.testcontainers.org/features/configuration/[TestContainers configuration file] (generally `~/.testcontainers.properties` or `C:/Users/myuser/.testcontainers.properties`):
ja_jp: コンテナをベースとした Dev Services に依存していると仮定した場合 (H2 とは異なり)、Dev Service コンテナを *開発モードセッションやテストスイート実行* 後も実行したままにして、次の開発モードセッションやテストスイート実行時に再利用することも可能です。link:https://java.testcontainers.org/features/reuse/[TestContainers の再利用] を有効にするには、link:https://java.testcontainers.org/features/configuration/[TestContainers の設定ファイル] (通常は `~/.testcontainers.properties` または `C:/Users/myuser/.testcontainers.properties` ) にこの行を挿入します:

source: Assuming your application supports two OIDC tenants (`hr`, and default) first you need to define one annotation per tenant ID other than default:
ja_jp: アプリケーションが 2 つの OIDC テナント (`hr` とデフォルト) をサポートしていると仮定した場合、最初にデフォルト以外のテナント ID ごとに 1 つのアノテーションを定義する必要があります。

source: Assuming your application supports two OIDC tenants, the `hr` and default tenants, all resource methods and classes carrying `@Tenant("hr")` are authenticated by using the OIDC provider configured by `quarkus.oidc.hr.auth-server-url`. In contrast, all other classes and methods are still authenticated by using the default OIDC provider.
ja_jp: アプリケーションが 2 つの OIDC テナント (`hr` テナントとデフォルトテナント) をサポートしていると仮定すると、`@Tenant("hr")` を持つすべてのリソースメソッドとクラスは、`quarkus.oidc.hr.auth-server-url` によって設定された OIDC プロバイダーを使用して認証されます。 対照的に、他のすべてのクラスとメソッドは、引き続きデフォルトの OIDC プロバイダーを使用して認証されます。

source: Async Reactive Types
ja_jp: 非同期リアクティブ型

source: Async Support
ja_jp: 非同期サポート

source: Async endpoints that return `Uni` support request cancellation, which means that if the underlying HTTP connection is closed for whatever reason, the request pipeline defined by the returned `Uni` is also cancelled. This can be very useful in avoiding unnecessary work on the server when the client isn't going to use the response anyway.
ja_jp: `Uni` を返す非同期エンドポイントはリクエストのキャンセルをサポートしています。つまり、何らかの理由で基盤となる HTTP 接続が閉じられた場合、返された `Uni` で定義されたリクエストパイプラインもキャンセルされます。これは、クライアントが応答を使用しない場合に、サーバー上での不要な作業を回避するのに非常に役立ちます。

source: Async/reactive support
ja_jp: 非同期/リアクティブサポート

source: Asynchronous Observers
ja_jp: 非同期オブザーバー

source: Asynchronous message passing - the component of a reactive system interact using messages
ja_jp: 非同期メッセージパッシング (Asynchronous message passing) - リアクティブシステムのコンポーネントがメッセージで相互作用すること

source: Asynchronous message passing - the components of a reactive system interact using messages
ja_jp: 非同期メッセージパッシング - リアクティブシステムのコンポーネントがメッセージを使用して相互作用すること

source: Asynchronous messaging for Reactive Streams
ja_jp: Reactive Streams 用の非同期メッセージング

source: Asynchronous methods => method returning a `Uni<T>`
ja_jp: 非同期メソッド⇒メソッドが返す `Uni<T>`

source: Asynchronous processing
ja_jp: 非同期処理

source: Asynchronous processing is also possible by returning either an `io.smallrye.mutiny.Uni` or a `java.util.concurrent.CompletionStage`:
ja_jp: `io.smallrye.mutiny.Uni` または `java.util.concurrent.CompletionStage` のどちらかを返すことで、非同期処理を行うことも可能です。

source: Asynchronously update the `SecurityIdentity` attached to the WebSocket server connection.
ja_jp: WebSocket サーバー接続にアタッチされた `SecurityIdentity` を非同期で更新します。

source: At `250 millicores` we had `Quarkus native 180 Mb` under 5 seconds, `Quarkus native 50 Mb` at 10 seconds, and the 2 others around 40 seconds.
ja_jp: `250 millicores` では、 `Quarkus native 180 Mb` が5秒以下、 `Quarkus native 50 Mb` が10秒、その他の2つが40秒前後でした。

source: At `50 millicores`, `Quarkus native 180 Mb` would run in 20 seconds, `Quarkus native 50 Mb` in 60 seconds, and the others 2 in 300 seconds. This meant that if we allowed `180 Mb` to _ocpdeploy_, we could go from 300 to 20 seconds. A _x15_ times improvement.
ja_jp: `50 millicores` では、 `Quarkus native 180 Mb` が 20 秒、 `Quarkus native 50 Mb` が 60 秒、その他の 2 つが 300 秒で実行されます。つまり、 `180 Mb` を _ocpdeploy_ に許可すれば、300秒から20秒になるということです。 _15_倍の改善です。

source: At a high level it this looks like this:
ja_jp: ハイレベルでは以下のようになります。
